advancedR/functions.org
#+STARTUP: overview
#+STARTUP: hideblocks
#+OPTIONS: toc:nil
#+PROPERTY: header-args :exports both
* Function components
** Primitive functions
*** What function allows you to tell if an object is a function? What function allows you to tell if a function is a primitive function?
#+BEGIN_SRC R
  is.primitive(sum)
#+END_SRC

#+RESULTS:
: TRUE

+ Side note:
  https://cran.r-project.org/doc/manuals/r-release/R-ints.html#g_t_002eInternal-vs-_002ePrimitive

*** This code makes a list of all functions in the base package.
#+BEGIN_SRC R :include.rownames true :session *myR*
  objs <- mget(ls("package:base"), inherits = TRUE)
  funs <- Filter(is.function, objs)
#+END_SRC

**** Which base function has the most arguments?

**** How many base functions have no arguments? What’s special about those functions?

**** How could you adapt the code to find all primitive functions?

#+BEGIN_SRC R :include.rownames true :session *myR*
  ## 2a
  n_args <- lapply(funs, function(x) length(formals(x)))
  max_arg <- n_args[which.max(unlist(n_args))]
  print(paste(names(max_arg), "has", max_arg, "arguments"))
#+END_SRC

#+BEGIN_SRC R :include.rownames true :session *myR*
  ## 2b
  no_arg <- sum(unlist(lapply(n_args, function(x) x == 0)))
  print(paste(no_arg, "functions have no arguments"))

  ## Most of them seem to be primitive
  ## sum(unlist(lapply(funs, function(x) length(formals(x)) == 0 && is.primitive(x))))
#+END_SRC

#+BEGIN_SRC R :include.rownames true :session *myR*
  ## 2c
  prim.funs <- Filter(is.primitive,Filter(is.function, objs))
#+END_SRC

#+RESULTS:

*** What are the three important components of a function?
#+BEGIN_SRC R
  ## body
  body() # the code inside the function.

  ## arguments
  formals() # the list of arguments which controls how you can call the function.

  ## enivronment
  environment() # the “map” of the location of the function’s variables.
#+END_SRC

*** When does printing a function not show what environment it was created in?
 E.g. primitive functions

* Lexical scoping
** What does the following code return? Why? What does each of the three c’s mean?
#+BEGIN_SRC R
  c <- 10
  c(c = c)
#+END_SRC

#+RESULTS:
: 10

+ c <- 10 assign a variable
+ c() combine function
+ c = c assign a name to argument

** What are the four principles that govern how R looks for values?
+ *name masking* - within lexical scoping
+ *functions vs. variables* - parenthesis causes R to ignore variables
+ *a fresh start* - function environment is created on each call
+ *dynamic lookup* - lookup is done on evaluation

** What does the following function return? Make a prediction before running the code yourself.
#+BEGIN_SRC R
  f <- function(x) {
    f <- function(x) {
      f <- function(x) {
	x ^ 2
      }
      f(x) + 1
    }
    f(x) * 2
  }
  f(10)
#+END_SRC

#+RESULTS:
: 202
* Every operation is a function call
* Function arguments
