advancedR/functions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-23 tor 15:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Andreas Karlsson" />
</head>
<body>
<div id="content">
<div id="outline-container-org744a741" class="outline-2">
<h2 id="org744a741"><span class="section-number-2">1</span> Function components</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org40de74e" class="outline-3">
<h3 id="org40de74e"><span class="section-number-3">1.1</span> Primitive functions</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-org83dd9c1" class="outline-4">
<h4 id="org83dd9c1"><span class="section-number-4">1.1.1</span> What function allows you to tell if an object is a function? What function allows you to tell if a function is a primitive function?</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">is.primitive</span><span style="color: #8c8c8c;">(</span>sum<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
TRUE
</pre>

<ul class="org-ul">
<li>Side note:
<a href="https://cran.r-project.org/doc/manuals/r-release/R-ints.html#g_t_002eInternal-vs-_002ePrimitive">https://cran.r-project.org/doc/manuals/r-release/R-ints.html#g_t_002eInternal-vs-_002ePrimitive</a></li>
</ul>
</div>
</div>

<div id="outline-container-org84626cb" class="outline-4">
<h4 id="org84626cb"><span class="section-number-4">1.1.2</span> This code makes a list of all functions in the base package.</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-R">objs <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">mget</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">ls</span><span style="color: #93a8c6;">(</span><span style="color: #87af5f;">"package:base"</span><span style="color: #93a8c6;">)</span>, inherits <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">TRUE</span><span style="color: #8c8c8c;">)</span>
funs <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">Filter</span><span style="color: #8c8c8c;">(</span>is.function, objs<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="org67c8b6e"></a>Which base function has the most arguments?<br /></li>

<li><a id="orgd9e3c50"></a>How many base functions have no arguments? What’s special about those functions?<br /></li>

<li><a id="org3db460e"></a>How could you adapt the code to find all primitive functions?<br /><div class="outline-text-5" id="text-1-1-2-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">2a</span>
n_args <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">lapply</span><span style="color: #8c8c8c;">(</span>funs, <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #93a8c6;">(</span>x<span style="color: #93a8c6;">)</span> <span style="color: #5fafff;">length</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">formals</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
max_arg <span style="color: #d7875f; font-weight: bold;">&lt;-</span> n_args<span style="color: #8c8c8c;">[</span><span style="color: #5fafff;">which.max</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">unlist</span><span style="color: #b0b1a3;">(</span>n_args<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
<span style="color: #5fafff;">print</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">paste</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">names</span><span style="color: #b0b1a3;">(</span>max_arg<span style="color: #b0b1a3;">)</span>, <span style="color: #87af5f;">"has"</span>, max_arg, <span style="color: #87af5f;">"arguments"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
scan has 22 arguments
</pre>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">2b</span>
no_arg <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">sum</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">unlist</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">lapply</span><span style="color: #b0b1a3;">(</span>n_args, <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #97b098;">(</span>x<span style="color: #97b098;">)</span> x <span style="color: #d7875f; font-weight: bold;">==</span> <span style="color: #5fafff;">0</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #5fafff;">print</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">paste</span><span style="color: #93a8c6;">(</span>no_arg, <span style="color: #87af5f;">"functions have no arguments"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">Most of them seem to be primitive</span>
<span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">sum(unlist(lapply(funs, function(x) length(formals(x)) == 0 &amp;&amp; is.primitive(x))))</span>
</pre>
</div>

<pre class="example">
225 functions have no arguments
</pre>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">2c</span>
prim.funs <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">Filter</span><span style="color: #8c8c8c;">(</span>is.primitive,<span style="color: #5fafff;">Filter</span><span style="color: #93a8c6;">(</span>is.function, objs<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-org4c52e29" class="outline-4">
<h4 id="org4c52e29"><span class="section-number-4">1.1.3</span> What are the three important components of a function?</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">body</span>
<span style="color: #5fafff;">body</span><span style="color: #8c8c8c;">()</span> <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">the code inside the function.</span>

<span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">arguments</span>
<span style="color: #5fafff;">formals</span><span style="color: #8c8c8c;">()</span> <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">the list of arguments which controls how you can call the function.</span>

<span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">enivronment</span>
<span style="color: #5fafff;">environment</span><span style="color: #8c8c8c;">()</span> <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">the &#8220;map&#8221; of the location of the function&#8217;s variables.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3769ce5" class="outline-4">
<h4 id="org3769ce5"><span class="section-number-4">1.1.4</span> When does printing a function not show what environment it was created in?</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
E.g. primitive functions
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb541810" class="outline-2">
<h2 id="orgb541810"><span class="section-number-2">2</span> Lexical scoping</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org5447c28" class="outline-3">
<h3 id="org5447c28"><span class="section-number-3">2.1</span> What does the following code return? Why? What does each of the three c’s mean?</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-R">c <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">10</span>
<span style="color: #5fafff;">c</span><span style="color: #8c8c8c;">(</span>c <span style="color: #d7875f; font-weight: bold;">=</span> c<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
10
</pre>

<ul class="org-ul">
<li>c &lt;- 10 assign a variable</li>
<li>c() combine function</li>
<li>c = c assign a name to argument</li>
</ul>
</div>
</div>

<div id="outline-container-org78b4dba" class="outline-3">
<h3 id="org78b4dba"><span class="section-number-3">2.2</span> What are the four principles that govern how R looks for values?</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><b>name masking</b> - within lexical scoping</li>
<li><b>functions vs. variables</b> - parenthesis causes R to ignore variables</li>
<li><b>a fresh start</b> - function environment is created on each call</li>
<li><b>dynamic lookup</b> - lookup is done on evaluation</li>
</ul>
</div>
</div>

<div id="outline-container-orga3cb689" class="outline-3">
<h3 id="orga3cb689"><span class="section-number-3">2.3</span> What does the following function return? Make a prediction before running the code yourself.</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">f</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>x<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #5fafff;">f</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #93a8c6;">(</span>x<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #5fafff;">f</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
      x ^ <span style="color: #5fafff;">2</span>
    <span style="color: #b0b1a3;">}</span>
    <span style="color: #5fafff;">f</span><span style="color: #b0b1a3;">(</span>x<span style="color: #b0b1a3;">)</span> <span style="color: #d7875f; font-weight: bold;">+</span> <span style="color: #5fafff;">1</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #5fafff;">f</span><span style="color: #93a8c6;">(</span>x<span style="color: #93a8c6;">)</span> * <span style="color: #5fafff;">2</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #5fafff;">f</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">10</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
202
</pre>
</div>
</div>
</div>
<div id="outline-container-org0b8acda" class="outline-2">
<h2 id="org0b8acda"><span class="section-number-2">3</span> Every operation is a function call</h2>
</div>
