advancedR/functions.org
** Clarify the following list of odd function calls:
#+BEGIN_SRC R
  x <- sample(x = c(1:10, NA), size = 20, replace = TRUE)
  y <- runif(n = 20, min = 0, max = 1)
  cor(x = x, y = y, use = "pairwise.complete.obs", method = "kendall")
#+END_SRC

** What does this function return? Why? Which principle does it illustrate?
#+BEGIN_SRC R
  f1 <- function(x = {y <- 1; 2}, y = 0) {
      x + y
  }
  f1()
#+END_SRC

#+RESULTS:
: 3

+ Lazy evaluation. As the default value for x is evaluated so is
  y. The default value for the y argument will there for not be used.

** What does this function return? Why? Which principle does it illustrate?
#+BEGIN_SRC R
  f2 <- function(x = z) {
    z <- 100
    x
  }
  f2()
#+END_SRC

#+RESULTS:
: 100
+ That default arguments can be defined in terms of variables created within the function.

* Special calls
** Create a list of all the replacement functions found in the base package. Which ones are primitive functions?
+ Replacement functions have special names xxx<-
#+BEGIN_SRC R
  objs <- mget(ls("package:base"), inherits = TRUE)
  funs <- Filter(is.function, objs)
  funs_name <- names(unlist(funs))
  grep(".<-$",funs_name, value = TRUE)
#+END_SRC

#+RESULTS:
| <<-              |
| [<-              |
| [[<-             |
| @<-              |
| $<-              |
| attr<-           |
| attributes<-     |
| body<-           |
| class<-          |
| colnames<-       |
| comment<-        |
| diag<-           |
| dim<-            |
| dimnames<-       |
| Encoding<-       |
| environment<-    |
| formals<-        |
| is.na<-          |
| length<-         |
| levels<-         |
| mode<-           |
| mostattributes<- |
| names<-          |
| oldClass<-       |
| parent.env<-     |
| regmatches<-     |
| row.names<-      |
| rownames<-       |
| split<-          |
| storage.mode<-   |
| substr<-         |
| substring<-      |
| units<-          |

** What are valid names for user-created infix functions?

All user-created infix functions must start and end with %. The names
of infix functions are more flexible than regular R functions: they
can contain any sequence of characters (except “%”, of course).

** Create an infix =xor()= operator.
#+BEGIN_SRC R
  `%xor%` <- function(a, b)  !a & b | a & !b # xor(a, b)

  a <- as.logical(rbinom(50, 1, 0.5))
  b <- as.logical(rbinom(50, 1, 0.5))

  identical(xor(a, b), a %xor% b)
#+END_SRC

#+RESULTS:
: TRUE

