advancedR/functions.html
<div id="outline-container-orge1d2786" class="outline-2">
<h2 id="orge1d2786"><span class="section-number-2">4</span> Function arguments</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgd8d205c" class="outline-3">
<h3 id="orgd8d205c"><span class="section-number-3">4.1</span> Clarify the following list of odd function calls:</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-R">x <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">sample</span><span style="color: #8c8c8c;">(</span>x <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">c</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">1</span>:<span style="color: #5fafff;">10</span>, <span style="color: #5fafff;">NA</span><span style="color: #93a8c6;">)</span>, size <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">20</span>, replace <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">TRUE</span><span style="color: #8c8c8c;">)</span>
y <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">runif</span><span style="color: #8c8c8c;">(</span>n <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">20</span>, min <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">0</span>, max <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">1</span><span style="color: #8c8c8c;">)</span>
<span style="color: #5fafff;">cor</span><span style="color: #8c8c8c;">(</span>x <span style="color: #d7875f; font-weight: bold;">=</span> x, y <span style="color: #d7875f; font-weight: bold;">=</span> y, use <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #87af5f;">"pairwise.complete.obs"</span>, method <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #87af5f;">"kendall"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
0.157715624693436
</pre>
</div>
</div>

<div id="outline-container-org369a8dc" class="outline-3">
<h3 id="org369a8dc"><span class="section-number-3">4.2</span> What does this function return? Why? Which principle does it illustrate?</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">f1</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>x <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #93a8c6;">{</span>y <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">1</span>; <span style="color: #5fafff;">2</span><span style="color: #93a8c6;">}</span>, y <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">0</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
    x <span style="color: #d7875f; font-weight: bold;">+</span> y
<span style="color: #8c8c8c;">}</span>
<span style="color: #5fafff;">f1</span><span style="color: #8c8c8c;">()</span>
</pre>
</div>

<pre class="example">
3
</pre>

<ul class="org-ul">
<li>Lazy evaluation. As the default value for x is evaluated so is
y. The default value for the y argument will there for not be used.</li>
</ul>
</div>
</div>

<div id="outline-container-org14bf399" class="outline-3">
<h3 id="org14bf399"><span class="section-number-3">4.3</span> What does this function return? Why? Which principle does it illustrate?</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">f2</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>x <span style="color: #d7875f; font-weight: bold;">=</span> z<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  z <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">100</span>
  x
<span style="color: #8c8c8c;">}</span>
<span style="color: #5fafff;">f2</span><span style="color: #8c8c8c;">()</span>
</pre>
</div>

<pre class="example">
100
</pre>
<ul class="org-ul">
<li>That default arguments can be defined in terms of variables created within the function.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8d9bcd2" class="outline-2">
<h2 id="org8d9bcd2"><span class="section-number-2">5</span> Special calls</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgc7cc1a1" class="outline-3">
<h3 id="orgc7cc1a1"><span class="section-number-3">5.1</span> Create a list of all the replacement functions found in the base package. Which ones are primitive functions?</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Replacement functions have special names xxx&lt;-</li>
</ul>
<div class="org-src-container">
<pre class="src src-R">objs <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">mget</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">ls</span><span style="color: #93a8c6;">(</span><span style="color: #87af5f;">"package:base"</span><span style="color: #93a8c6;">)</span>, inherits <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">TRUE</span><span style="color: #8c8c8c;">)</span>
funs <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">Filter</span><span style="color: #8c8c8c;">(</span>is.function, objs<span style="color: #8c8c8c;">)</span>
funs_name <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">names</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">unlist</span><span style="color: #93a8c6;">(</span>funs<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #5fafff;">grep</span><span style="color: #8c8c8c;">(</span><span style="color: #87af5f;">".&lt;-$"</span>,funs_name, value <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">TRUE</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&lt;&lt;-</td>
</tr>

<tr>
<td class="org-left">[&lt;-</td>
</tr>

<tr>
<td class="org-left">[[&lt;-</td>
</tr>

<tr>
<td class="org-left">@&lt;-</td>
</tr>

<tr>
<td class="org-left">$&lt;-</td>
</tr>

<tr>
<td class="org-left">attr&lt;-</td>
</tr>

<tr>
<td class="org-left">attributes&lt;-</td>
</tr>

<tr>
<td class="org-left">body&lt;-</td>
</tr>

<tr>
<td class="org-left">class&lt;-</td>
</tr>

<tr>
<td class="org-left">colnames&lt;-</td>
</tr>

<tr>
<td class="org-left">comment&lt;-</td>
</tr>

<tr>
<td class="org-left">diag&lt;-</td>
</tr>

<tr>
<td class="org-left">dim&lt;-</td>
</tr>

<tr>
<td class="org-left">dimnames&lt;-</td>
</tr>

<tr>
<td class="org-left">Encoding&lt;-</td>
</tr>

<tr>
<td class="org-left">environment&lt;-</td>
</tr>

<tr>
<td class="org-left">formals&lt;-</td>
</tr>

<tr>
<td class="org-left">is.na&lt;-</td>
</tr>

<tr>
<td class="org-left">length&lt;-</td>
</tr>

<tr>
<td class="org-left">levels&lt;-</td>
</tr>

<tr>
<td class="org-left">mode&lt;-</td>
</tr>

<tr>
<td class="org-left">mostattributes&lt;-</td>
</tr>

<tr>
<td class="org-left">names&lt;-</td>
</tr>

<tr>
<td class="org-left">oldClass&lt;-</td>
</tr>

<tr>
<td class="org-left">parent.env&lt;-</td>
</tr>

<tr>
<td class="org-left">regmatches&lt;-</td>
</tr>

<tr>
<td class="org-left">row.names&lt;-</td>
</tr>

<tr>
<td class="org-left">rownames&lt;-</td>
</tr>

<tr>
<td class="org-left">split&lt;-</td>
</tr>

<tr>
<td class="org-left">storage.mode&lt;-</td>
</tr>

<tr>
<td class="org-left">substr&lt;-</td>
</tr>

<tr>
<td class="org-left">substring&lt;-</td>
</tr>

<tr>
<td class="org-left">units&lt;-</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org89ddb8f" class="outline-3">
<h3 id="org89ddb8f"><span class="section-number-3">5.2</span> What are valid names for user-created infix functions?</h3>
<div class="outline-text-3" id="text-5-2">
<p>
All user-created infix functions must start and end with %. The names
of infix functions are more flexible than regular R functions: they
can contain any sequence of characters (except “%”, of course).
</p>
</div>
</div>

<div id="outline-container-org93b88c4" class="outline-3">
<h3 id="org93b88c4"><span class="section-number-3">5.3</span> Create an infix <code>xor()</code> operator.</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">`%xor%`</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>a, b<span style="color: #8c8c8c;">)</span>  !a &amp; b | a &amp; !b <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">xor(a, b)</span>

a <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">as.logical</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">rbinom</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">50</span>, <span style="color: #5fafff;">1</span>, <span style="color: #5fafff;">0.5</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
b <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">as.logical</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">rbinom</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">50</span>, <span style="color: #5fafff;">1</span>, <span style="color: #5fafff;">0.5</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>

<span style="color: #5fafff;">identical</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">xor</span><span style="color: #93a8c6;">(</span>a, b<span style="color: #93a8c6;">)</span>, a <span style="color: #d7875f; font-weight: bold;">%xor%</span> b<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
TRUE
</pre>
</div>
</div>
