advancedR/functions.org
** Create infix versions of the set functions =intersect()=, =union()=, and =setdiff()=.
#+BEGIN_SRC R
  v1 <- letters[1:5]
  v2 <- letters[4:8]

  `%U%` <- function(a, b) unique(c(a, b))
  identical(union(v1, v2), v1 %U% v2)

  `%∩%` <- function(a, b) b[match(a, b, 0L)]
  identical(intersect(v1, v2), v1 %∩% v2)

  `%\\%` <- function(a, b) a[!match(a, b, 0L)]
  identical(setdiff(v1, v2), v1 %\% v2)
#+END_SRC
** Create a replacement function that modifies a random location in a vector.
#+BEGIN_SRC R
  `rReplace<-` <- function(x, value) {
    x[sample(x, 1)] <- value
    x
  }
  x <- 1:10
  rReplace(x) <- 42
#+END_SRC

* Return values
** How does the chdir parameter of =source()= compare to =in_dir()=? Why might you prefer one approach to the other?
The =chdir= argument in =source()= uses =add = TRUE=, i.e. adds to previous
=on.exit()=.

** What function undoes the action of =library()=? How do you save and restore the values of =options()= and =par()=?

#+BEGIN_SRC R
  library(ggplot2)
  detach("package:ggplot2", unload=TRUE)

  op <- options()
  options(op)     # reset (all) initial options

  old.par <- par(no.readonly = TRUE) # all par settings which
                                          # could be changed.
  par(old.par)
#+END_SRC

** Write a function that opens a graphics device, runs the supplied code, and closes the graphics device (always, regardless of whether or not the plotting code worked).

#+BEGIN_SRC R :exports code
  myplot <- function(code) {
      dev.new()
      on.exit(dev.off())
      force(code)
  }

  myplot(plot(rnorm))
#+END_SRC

** We can use =on.exit()= to implement a simple version of =capture.output()=.
By closing/removing the file in a =on.exit( add = TRUE)= much of logic
for when to close the file appears to have been reduced.

* Quiz
** What are the three components of a function?
   + body
   + arguments (compare function signature)
   + environment

** What does the following code return?
   #+BEGIN_SRC R
     x <- 10
     f1 <- function(x) {
         function() {
             x + 10
         }
     }
     f1(1)()
   #+END_SRC

   #+RESULTS:
   : 11

** How would you more typically write this code?

#+BEGIN_SRC R
  `+`(1, `*`(2, 3))
#+END_SRC

#+RESULTS:
: 7

#+BEGIN_SRC R
  (1 + (2 * 3))
#+END_SRC

#+RESULTS:
: 7

+ Compare with lisp:
#+BEGIN_SRC elisp
  (+ 1 0 (* 2 3 1 1 1))
#+END_SRC

#+RESULTS:
: 7


