advancedR/functions.html

<div id="outline-container-orgaa40cf1" class="outline-3">
<h3 id="orgaa40cf1"><span class="section-number-3">5.4</span> Create infix versions of the set functions <code>intersect()</code>, <code>union()</code>, and <code>setdiff()</code>.</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-R">v1 <span style="color: #d7875f; font-weight: bold;">&lt;-</span> letters<span style="color: #8c8c8c;">[</span><span style="color: #5fafff;">1</span>:<span style="color: #5fafff;">5</span><span style="color: #8c8c8c;">]</span>
v2 <span style="color: #d7875f; font-weight: bold;">&lt;-</span> letters<span style="color: #8c8c8c;">[</span><span style="color: #5fafff;">4</span>:<span style="color: #5fafff;">8</span><span style="color: #8c8c8c;">]</span>

<span style="color: #5fafff;">`%U%`</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>a, b<span style="color: #8c8c8c;">)</span> <span style="color: #5fafff;">unique</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">c</span><span style="color: #93a8c6;">(</span>a, b<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
<span style="color: #5fafff;">identical</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">union</span><span style="color: #93a8c6;">(</span>v1, v2<span style="color: #93a8c6;">)</span>, v1 <span style="color: #d7875f; font-weight: bold;">%U%</span> v2<span style="color: #8c8c8c;">)</span>

<span style="color: #5fafff;">`%&#8745;%`</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>a, b<span style="color: #8c8c8c;">)</span> b<span style="color: #8c8c8c;">[</span><span style="color: #5fafff;">match</span><span style="color: #93a8c6;">(</span>a, b, <span style="color: #5fafff;">0L</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
<span style="color: #5fafff;">identical</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">intersect</span><span style="color: #93a8c6;">(</span>v1, v2<span style="color: #93a8c6;">)</span>, v1 <span style="color: #d7875f; font-weight: bold;">%&#8745;%</span> v2<span style="color: #8c8c8c;">)</span>

<span style="color: #5fafff;">`%\\%`</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>a, b<span style="color: #8c8c8c;">)</span> a<span style="color: #8c8c8c;">[</span>!<span style="color: #5fafff;">match</span><span style="color: #93a8c6;">(</span>a, b, <span style="color: #5fafff;">0L</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">]</span>
<span style="color: #5fafff;">identical</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">setdiff</span><span style="color: #93a8c6;">(</span>v1, v2<span style="color: #93a8c6;">)</span>, v1 <span style="color: #d7875f; font-weight: bold;">%\% v2)</span>
</pre>
</div>

<pre class="example">
TRUE
</pre>
</div>
</div>

<div id="outline-container-org7abd9ad" class="outline-3">
<h3 id="org7abd9ad"><span class="section-number-3">5.5</span> Create a replacement function that modifies a random location in a vector.</h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">`rReplace&lt;-`</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>x, value<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  x<span style="color: #93a8c6;">[</span><span style="color: #5fafff;">sample</span><span style="color: #b0b1a3;">(</span>x, <span style="color: #5fafff;">1</span><span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">]</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> value
  x
<span style="color: #8c8c8c;">}</span>
x <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">1</span>:<span style="color: #5fafff;">10</span>
<span style="color: #5fafff;">rReplace</span><span style="color: #8c8c8c;">(</span>x<span style="color: #8c8c8c;">)</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">42</span>
</pre>
</div>

<pre class="example">
42
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeed91d8" class="outline-2">
<h2 id="orgeed91d8"><span class="section-number-2">6</span> Return values</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-org4a43537" class="outline-3">
<h3 id="org4a43537"><span class="section-number-3">6.1</span> How does the chdir parameter of <code>source()</code> compare to <code>in_dir()</code>? Why might you prefer one approach to the other?</h3>
<div class="outline-text-3" id="text-6-1">
<p>
The <code>chdir</code> argument in <code>source()</code> uses <code>add = TRUE</code>, i.e. adds to previous
<code>on.exit()</code>.
</p>
</div>
</div>

<div id="outline-container-org0c1d97b" class="outline-3">
<h3 id="org0c1d97b"><span class="section-number-3">6.2</span> What function undoes the action of <code>library()</code>? How do you save and restore the values of <code>options()</code> and <code>par()</code>?</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #d7875f; font-weight: bold;">library</span><span style="color: #8c8c8c;">(</span>ggplot2<span style="color: #8c8c8c;">)</span>
<span style="color: #d7875f; font-weight: bold;">detach</span><span style="color: #8c8c8c;">(</span><span style="color: #87af5f;">"package:ggplot2"</span>, unload<span style="color: #d7875f; font-weight: bold;">=</span><span style="color: #5fafff;">TRUE</span><span style="color: #8c8c8c;">)</span>

op <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">options</span><span style="color: #8c8c8c;">()</span>
<span style="color: #5fafff;">options</span><span style="color: #8c8c8c;">(</span>op<span style="color: #8c8c8c;">)</span>     <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">reset (all) initial options</span>

old.par <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">par</span><span style="color: #8c8c8c;">(</span>no.readonly <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">TRUE</span><span style="color: #8c8c8c;">)</span> <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">all par settings which</span>
                                        <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">could be changed.</span>
<span style="color: #5fafff;">par</span><span style="color: #8c8c8c;">(</span>old.par<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga0a9b2d" class="outline-3">
<h3 id="orga0a9b2d"><span class="section-number-3">6.3</span> Write a function that opens a graphics device, runs the supplied code, and closes the graphics device (always, regardless of whether or not the plotting code worked).</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">myplot</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>code<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
    <span style="color: #5fafff;">dev.new</span><span style="color: #93a8c6;">()</span>
    <span style="color: #5fafff;">on.exit</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">dev.off</span><span style="color: #b0b1a3;">()</span><span style="color: #93a8c6;">)</span>
    <span style="color: #5fafff;">force</span><span style="color: #93a8c6;">(</span>code<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">}</span>

<span style="color: #5fafff;">myplot</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">plot</span><span style="color: #93a8c6;">(</span>rnorm<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c3a746" class="outline-3">
<h3 id="org5c3a746"><span class="section-number-3">6.4</span> We can use <code>on.exit()</code> to implement a simple version of <code>capture.output()</code>.</h3>
<div class="outline-text-3" id="text-6-4">
<p>
By closing/removing the file in a <code>on.exit( add = TRUE)</code> much of logic
for when to close the file appears to have been reduced.
</p>
</div>
</div>
</div>

<div id="outline-container-org41a396a" class="outline-2">
<h2 id="org41a396a"><span class="section-number-2">7</span> Quiz</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-org8072c53" class="outline-3">
<h3 id="org8072c53"><span class="section-number-3">7.1</span> What are the three components of a function?</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>body</li>
<li>arguments (compare function signature)</li>
<li>environment</li>
</ul>
</div>
</div>

<div id="outline-container-org7a9fc35" class="outline-3">
<h3 id="org7a9fc35"><span class="section-number-3">7.2</span> What does the following code return?</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-R">x <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #5fafff;">10</span>
<span style="color: #5fafff;">f1</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>x<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
    <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #93a8c6;">()</span> <span style="color: #93a8c6;">{</span>
        x <span style="color: #d7875f; font-weight: bold;">+</span> <span style="color: #5fafff;">10</span>
    <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #5fafff;">f1</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">1</span><span style="color: #8c8c8c;">)()</span>
</pre>
</div>

<pre class="example">
11
</pre>
</div>
</div>

<div id="outline-container-orgdbf1c33" class="outline-3">
<h3 id="orgdbf1c33"><span class="section-number-3">7.3</span> How would you more typically write this code?</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">`+`</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">1</span>, <span style="color: #5fafff;">`*`</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">2</span>, <span style="color: #5fafff;">3</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
7
</pre>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">1</span> <span style="color: #d7875f; font-weight: bold;">+</span> <span style="color: #93a8c6;">(</span><span style="color: #5fafff;">2</span> * <span style="color: #5fafff;">3</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
7
</pre>

<ul class="org-ul">
<li>Compare with lisp:</li>
</ul>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #8c8c8c;">(</span>+ 1 0 <span style="color: #93a8c6;">(</span>* 2 3 1 1 1<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
7
</pre>
</div>
</div>
