advancedR/functions.org
** How could you make this call easier to read?


#+BEGIN_SRC R
  mean(, TRUE, x = c(1:10, NA))
#+END_SRC

#+RESULTS:
: 5.5

#+BEGIN_SRC R
  mean(x = c(1:10, NA), na.rm=TRUE)
#+END_SRC

#+RESULTS:
: 5.5


** Does the following function throw an error when called? Why/why not?

#+BEGIN_SRC R
  f2 <- function(a, b) {
    a * 10
  }
  f2(10, stop("This is an error!"))
#+END_SRC

#+RESULTS:
: 100

   + Lazy evaluation (b is not used).

** What is an infix function? How do you write it? What’s a replacement function? How do you write it?

   + The function name comes in between its arguments. `%+%` <- function

   + Replacement functions act like they modify their arguments in
     place, and have the special name xxx<-.
#+BEGIN_SRC R :exports code :eval never
  `xxx<-` <- function
#+END_SRC

** What function do you use to ensure that a cleanup action occurs regardless of how a function terminates?
   + on.exit()

# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
