advancedR/functions.html


<div id="outline-container-org6a3e4a9" class="outline-3">
<h3 id="org6a3e4a9"><span class="section-number-3">7.4</span> How could you make this call easier to read?</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">mean</span><span style="color: #8c8c8c;">(</span>, <span style="color: #5fafff;">TRUE</span>, x <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">c</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">1</span>:<span style="color: #5fafff;">10</span>, <span style="color: #5fafff;">NA</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
5.5
</pre>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">mean</span><span style="color: #8c8c8c;">(</span>x <span style="color: #d7875f; font-weight: bold;">=</span> <span style="color: #5fafff;">c</span><span style="color: #93a8c6;">(</span><span style="color: #5fafff;">1</span>:<span style="color: #5fafff;">10</span>, <span style="color: #5fafff;">NA</span><span style="color: #93a8c6;">)</span>, na.rm<span style="color: #d7875f; font-weight: bold;">=</span><span style="color: #5fafff;">TRUE</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
5.5
</pre>
</div>
</div>


<div id="outline-container-org646bc35" class="outline-3">
<h3 id="org646bc35"><span class="section-number-3">7.5</span> Does the following function throw an error when called? Why/why not?</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">f2</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span><span style="color: #8c8c8c;">(</span>a, b<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  a * <span style="color: #5fafff;">10</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #5fafff;">f2</span><span style="color: #8c8c8c;">(</span><span style="color: #5fafff;">10</span>, <span style="color: #d787d7; font-weight: bold;">stop</span><span style="color: #93a8c6;">(</span><span style="color: #87af5f;">"This is an error!"</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<pre class="example">
100
</pre>

<ul class="org-ul">
<li>Lazy evaluation (b is not used).</li>
</ul>
</div>
</div>

<div id="outline-container-org5e6d850" class="outline-3">
<h3 id="org5e6d850"><span class="section-number-3">7.6</span> What is an infix function? How do you write it? What’s a replacement function? How do you write it?</h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li>The function name comes in between its arguments. `%+%` &lt;- function</li>

<li>Replacement functions act like they modify their arguments in
place, and have the special name xxx&lt;-.</li>
</ul>
<div class="org-src-container">
<pre class="src src-R"><span style="color: #5fafff;">`xxx&lt;-`</span> <span style="color: #d7875f; font-weight: bold;">&lt;-</span> <span style="color: #d787d7; font-weight: bold;">function</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf2e374" class="outline-3">
<h3 id="orgdf2e374"><span class="section-number-3">7.7</span> What function do you use to ensure that a cleanup action occurs regardless of how a function terminates?</h3>
<div class="outline-text-3" id="text-7-7">
<ul class="org-ul">
<li>on.exit()</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andreas Karlsson</p>
<p class="date">Created: 2017-02-23 tor 15:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
